# Pandas merge

This is a notebook for the medium article [All the Pandas merge() you should know for combining datasets](https://bindichen.medium.com/all-the-pandas-merge-you-should-know-for-combining-datasets-526b9ecaf184)

Please check out article for instructions

**License**: [BSD 2-Clause](https://opensource.org/licenses/BSD-2-Clause)

In [1]:
import pandas as pd

In [2]:
df_customer = pd.DataFrame({
    'id': [1,2,3,4],
    'name': ['Tom', 'Jenny', 'James', 'Dan'],
})
df_customer

   id   name
0   1    Tom
1   2  Jenny
2   3  James
3   4    Dan

In [3]:
df_info = pd.DataFrame({
    'id': [2,3,4,5],
    'age': [31,20,40,70],
    'sex': ['F', 'M', 'M', 'F']
})
df_info

   id  age sex
0   2   31   F
1   3   20   M
2   4   40   M
3   5   70   F

## 1. Without any key column

In [4]:
pd.merge(df_customer, df_info)

   id   name  age sex
0   2  Jenny   31   F
1   3  James   20   M
2   4    Dan   40   M

In [5]:
# equivlant to 
df_customer.merge(df_info)

   id   name  age sex
0   2  Jenny   31   F
1   3  James   20   M
2   4    Dan   40   M

## 2. Specifying key columns using argument `on`

In [6]:
# Single key columns
pd.merge(df_customer, df_info, on='id')

   id   name  age sex
0   2  Jenny   31   F
1   3  James   20   M
2   4    Dan   40   M

In [7]:
# with multiple key columns
df_order = pd.DataFrame({
    'id': [2,3,4,5],
    'name': ['Jenny', 'James', 'Dan', 'leo'],
    'quantity': [2,4,6,10]
})


pd.merge(df_customer, df_order, on=['id','name'])

   id   name  quantity
0   2  Jenny         2
1   3  James         4
2   4    Dan         6

## 3. Using `left_on` and `right_on`

In [8]:
df_info_2 = pd.DataFrame({
    'customer_id': [2,3,4,5],
    'age': [31,20,40,70],
    'sex': ['F', 'M', 'M', 'F']
})
df_info_2

   customer_id  age sex
0            2   31   F
1            3   20   M
2            4   40   M
3            5   70   F

In [9]:
pd.merge(df_customer, df_info_2, left_on='id', right_on='customer_id')

   id   name  customer_id  age sex
0   2  Jenny            2   31   F
1   3  James            3   20   M
2   4    Dan            4   40   M

## 4. Join option `how`

In [10]:
df_customer = pd.DataFrame({
    'id': [1,2,3,4],
    'name': ['Tom', 'Jenny', 'James', 'Dan'],
})


df_info = pd.DataFrame({
    'id': [2,3,4,5],
    'age': [31,20,40,70],
    'sex': ['F', 'M', 'M', 'F']
})

In [11]:
df_customer

   id   name
0   1    Tom
1   2  Jenny
2   3  James
3   4    Dan

In [12]:
df_info

   id  age sex
0   2   31   F
1   3   20   M
2   4   40   M
3   5   70   F

### 4.1 inner

In [13]:
pd.merge(df_customer, df_info, how='inner', on='id')
# pd.merge(df_customer, df_info, on='id')

   id   name  age sex
0   2  Jenny   31   F
1   3  James   20   M
2   4    Dan   40   M

### 4.2 left

In [14]:
pd.merge(df_customer, df_info, how='left', on='id')

   id   name   age  sex
0   1    Tom   NaN  NaN
1   2  Jenny  31.0    F
2   3  James  20.0    M
3   4    Dan  40.0    M

### 4.3 right

In [15]:
pd.merge(df_customer, df_info, how='right', on='id')

   id   name  age sex
0   2  Jenny   31   F
1   3  James   20   M
2   4    Dan   40   M
3   5    NaN   70   F

### 4.4 outer

In [16]:
pd.merge(df_customer, df_info, how='outer', on='id')

   id   name   age  sex
0   1    Tom   NaN  NaN
1   2  Jenny  31.0    F
2   3  James  20.0    M
3   4    Dan  40.0    M
4   5    NaN  70.0    F

## 5. Using `validate` to avoid invalid records

In [17]:
df_customer = pd.DataFrame({
    'id': [1,2,3,4],
    'name': ['Tom', 'Jenny', 'James', 'Dan'],
})

df_order_2 = pd.DataFrame({
    'id': [2,2,4,4],
    'product': ['A', 'B' ,'A', 'C'],
    'quantity': [31, 21, 20,40],
    'date': pd.date_range('2019-02-24', periods=4, freq='D')
})

In [18]:
df_order_2

   id product  quantity       date
0   2       A        31 2019-02-24
1   2       B        21 2019-02-25
2   4       A        20 2019-02-26
3   4       C        40 2019-02-27

In [19]:
pd.merge(df_customer, df_order_2, how='left', on='id')

   id   name product  quantity       date
0   1    Tom     NaN       NaN        NaT
1   2  Jenny       A      31.0 2019-02-24
2   2  Jenny       B      21.0 2019-02-25
3   3  James     NaN       NaN        NaT
4   4    Dan       A      20.0 2019-02-26
5   4    Dan       C      40.0 2019-02-27

In [20]:
df_customer = pd.DataFrame({
    'id': [1,2,3,4],
    'name': ['Tom', 'Jenny', 'James', 'Dan'],
})


df_info = pd.DataFrame({
    'id': [2,2,3,4,5],
    'age': [31,21, 20,40,70],
    'sex': ['F', 'F' ,'M', 'M', 'F']
})

In [21]:
pd.merge(df_customer, df_info, how='left', on='id')

   id   name   age  sex
0   1    Tom   NaN  NaN
1   2  Jenny  31.0    F
2   2  Jenny  21.0    F
3   3  James  20.0    M
4   4    Dan  40.0    M

In [23]:
pd.merge(df_customer, df_info, how='left', on='id', validate='1:1')

MergeError: Merge keys are not unique in right dataset; not a one-to-one merge